deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_app/projects/app/src/reader_init.c
#include <string.h>
#include "reader_init.h"
#include "app_conf.h"
#include "hc32f46_driver.h"
#include "reader_msg.h"
#include "ErrChecker.h"
#include "http_callback.h"
#include "mqtt_interface.h"
#include "MQTTClient.h"
#include "mp_pool.h"
#include "hw_api.h"   /* v9.81ci: driver config access */
#include "msg_bus.h"   /* v1.0: 消息总线 */

int gAntNumber = -1;   /* v9.81ch: 非 static——driver_lib readercfg.o 链接依赖 */
static int uart0_bauds[] = {921600,115200, 460800, 9600, 230400, 57600, 38400, 19200};
static int uart0_bindex = 0;
static char gAddrBuf[20];
static ConnAnts_ST gConnants;
static int ghReader;
static uint8 gIsUnknownMod = 0;
static int gCanAsyncInv = 1;

static int TagSendBufLen = 1580;
static int CmdRecvBufLen = 256;

unsigned char *SockSendBuffer;
unsigned char *SockRecvBuffer;

#define RDR_PARA_OP(pset) \
    do { \
        rerr = pset; \
        if (rerr != MT_OK_ERR) \
        { \
            int derrcode = 0; char *derrstr = NULL; \
            GetLastDetailError(ghReader, &derrcode, &derrstr); \
            TRACE("%s err:%d detail:%d %s\n", #pset, rerr, derrcode, derrstr ? derrstr : ""); \
            sprintf(gRdrErrStrBuf, "init reader failed:%s", #pset); \
            if (is_ret == 1) \
                return rerr; \
            else \
                is_ret = 1; \
        } \
        else \
            TRACE("%s ok\n", #pset); \
    } while (0)

extern char *gRdrErrStrBuf;
void set_rdr_errstring(char *prefix)
{
    int derrcode;
    char *errstr;
    unsigned char tmpbuf[25];

    GetLastDetailError(ghReader, &derrcode, &errstr);
    sprintf(gRdrErrStrBuf, "%s-%s", prefix, errstr);

    if (derrcode == 0x0505 && gPRdrStaSet->tagops_param.inventory.cycle == 0)
    {
        ParamGet(ghReader, MTR_PARAM_READER_ERRORDATA, tmpbuf);
        sprintf(gRdrErrStrBuf + strlen(gRdrErrStrBuf), "-ant_%d", tmpbuf[1]);
    }
}

READER_ERR GetPortsNumber(int hreader)
{
    READER_ERR rerr = MT_OK_ERR;
    unsigned char rdrver[8] = {0};
    int i;
    HardwareDetails hwdetal;

    rerr = ParamGet(hreader, MTR_PARAM_READER_VERSION, rdrver);

    if (rerr != MT_OK_ERR)
    {
        set_rdr_errstring("init reader failed");
        CloseReader(ghReader);
        TRACE("MTR_PARAM_READER_VERSION err:%d\n", rerr);
        return rerr;
    }

    TRACE("rdrver:");

    for (i = 0; i < 8; ++i)
        TRACE("%02X ", rdrver[i]);

    TRACE("\n");
    memcpy(hw_brdcst_info()->modtype, rdrver, 2);
    memcpy(hw_brdcst_info()->modfwver, rdrver + 4, 4);

    GetHardwareDetails(hreader, &hwdetal);

    if (hwdetal.module == MODOULE_SLR5100 ||
            hwdetal.module == MODOULE_SLR5200 ||
            hwdetal.module == MODOULE_SLR5300)
        gCanAsyncInv = 0;

    hb_data()->rfid_mod = hwdetal.module;
    ParamGet(hreader, MTR_PARAM_READER_AVAILABLE_ANTPORTS, &gAntNumber);
    TRACE("!!!!!!!!!!!!!!! rfid_mod:%d, gAntNumber:%d\n", hb_data()->rfid_mod, gAntNumber);
    return rerr;
}


READER_ERR OpenReader()
{
    AntPowerConf pwrs;
    int i;
    READER_ERR rerr = MT_OK_ERR;
    int is_ret = 1;
    unsigned short tmpushort;
    int tmpint;

    TRACE("power off module now:%lld\n", getSysTick());
    rfid_power_off();
    sleep_ms(1000);   /* v9.81cl: 100ms 太短，模块供电电容放不完电，卡死状态无法复位 → 1s */
    TRACE("power on module now:%lld\n", getSysTick());
    rfid_power_on();
    sleep_ms(500);
    TRACE("after power on module now:%lld\n", getSysTick());

    if (gAntNumber == -1)
    {
        for (uart0_bindex = 0; uart0_bindex < 8; ++uart0_bindex)
        {
            sprintf(gAddrBuf, "uart0:%d", uart0_bauds[uart0_bindex]);
            TRACE("addrbuf:%s\n", gAddrBuf);
            rerr = InitReader(&ghReader, gAddrBuf, MODULE_ONE_ANT);

            if (rerr == MT_OK_ERR)
                break;
            else if (rerr == MT_TEST_DEV_FAULT_5)
            {
                gIsUnknownMod = 1;
                strcpy(gRdrErrStrBuf, "init reader failed:unknown type rfid module");
                return MT_TEST_DEV_FAULT_5;
            }
            else
                TRACE("%s failed\n", gAddrBuf);
        }

        if (rerr != MT_OK_ERR)
        {
            strcpy(gRdrErrStrBuf, "init reader failed:io error");
            TRACE("InitReader err:%d\n", rerr);
            return rerr;
        }

        rerr = GetPortsNumber(ghReader);

        if (rerr != MT_OK_ERR)
            return rerr;
    }
    else
    {
        TRACE("before InitReader, gAddrBuf:%s\n", gAddrBuf);
        rerr = InitReader(&ghReader, gAddrBuf, MODULE_ONE_ANT);

        if (rerr != MT_OK_ERR)
        {
            strcpy(gRdrErrStrBuf, "init reader failed:init second io error");
            return rerr;
        }
    }

    TRACE("InitReader Ok\n");

    dump_static_settings(gPRdrStaSet);

    /* v9.81cl: gen2 参数设置全部降级为 best-effort——配置里任何非法值
     * （如 q=-1 被模块拒绝）只记录警告，不再中断整个读卡初始化；
     * 模块保留自身默认值继续工作，杜绝"设备能启动但 RFID 死掉"的危险模式。 */
    if (gPRdrStaSet->protocol.gen2.session != -1)
    {
        tmpint = gPRdrStaSet->protocol.gen2.session;
        if (ParamSet(ghReader, MTR_PARAM_POTL_GEN2_SESSION, &tmpint) != MT_OK_ERR)
            TRACE("warn: GEN2_SESSION set fail, use module default\n");
    }

    if (gPRdrStaSet->protocol.gen2.q != -2 && gPRdrStaSet->protocol.gen2.q != -1)
    {
        tmpint = gPRdrStaSet->protocol.gen2.q;
        if (ParamSet(ghReader, MTR_PARAM_POTL_GEN2_Q, &tmpint) != MT_OK_ERR)
            TRACE("warn: GEN2_Q set fail, use module default\n");
    }

    if (gPRdrStaSet->protocol.gen2.target != -1)
    {
        tmpint = gPRdrStaSet->protocol.gen2.target;
        if (ParamSet(ghReader, MTR_PARAM_POTL_GEN2_TARGET, &tmpint) != MT_OK_ERR)
            TRACE("warn: GEN2_TARGET set fail, use module default\n");
    }

    if (gPRdrStaSet->protocol.gen2.profile != -1)
    {
//				RDR_PARA_OP(ParamSet(*prdr, MTR_PARAM_POTL_GEN2_TAGENCODING, &gPRdrStaSet->protocol.gen2.profile));
        tmpint = gPRdrStaSet->protocol.gen2.profile;
        ParamSet(ghReader, MTR_PARAM_POTL_GEN2_TAGENCODING, &tmpint);
    }

    if (gPRdrStaSet->rf.ant_max_dwell_time > 0)
    {
        is_ret = 0;
        RDR_PARA_OP(ParamSet(ghReader, MTR_PARAM_RF_HOPANTTIME, &gPRdrStaSet->rf.ant_max_dwell_time));
    }

