deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_app/projects/app/src/reader_init.c
    if (gPRdrStaSet->rf.hop_mode != -1)
    {
        if (hb_data()->rfid_mod == MODOULE_SLR5900 ||
                hb_data()->rfid_mod == MODOULE_SLR5800 ||
                hb_data()->rfid_mod == MODOULE_SLR6000 ||
                hb_data()->rfid_mod == MODOULE_SLR6100 ||
                hb_data()->rfid_mod == MODOULE_SLR1100)
        {
            CustomParam_ST cpst;
            char cuscmd[52];
            cpst.pCusParam = cuscmd;
            cpst.CParamlen = 52;
            cuscmd[50] = gPRdrStaSet->rf.hop_mode;
            strcpy(cuscmd, "rfcommon/hopmode");
            RDR_PARA_OP(ParamSet(ghReader, MTR_PARAM_CUSTOM, &cpst));
        }
    }

    if (gPRdrStaSet->rf.region != -1)
    {
        Region_Conf tmprg = (Region_Conf)gPRdrStaSet->rf.region;
        RDR_PARA_OP(ParamSet(ghReader, MTR_PARAM_FREQUENCY_REGION, &tmprg));
    }

    if (gPRdrStaSet->rf.hop_table_cnt != 0)
    {
        HoptableData_ST hptab;
        hptab.lenhtb = gPRdrStaSet->rf.hop_table_cnt;

        for (i = 0; i < hptab.lenhtb; ++i)
            hptab.htb[i] = gPRdrStaSet->rf.hop_table[i];

        is_ret = 0;
        RDR_PARA_OP(ParamSet(ghReader, MTR_PARAM_FREQUENCY_HOPTABLE, &hptab));
    }

    RDR_PARA_OP(ParamGet(ghReader, MTR_PARAM_RF_MAXPOWER, &tmpushort));
    pwrs.antcnt = 0;

    for (i = 0; i < gAntNumber; ++i)
    {
        if (gPRdrStaSet->rf.tx_powers[i].read_power != -2)
        {
            if (gPRdrStaSet->rf.tx_powers[i].read_power != -1)	//2025-03-14
                //	pwrs.Powers[pwrs.antcnt].readPower = gPRdrStaSet->rf.tx_powers[i].read_power<1000 ? 1000: gPRdrStaSet->rf.tx_powers[i].read_power;
                pwrs.Powers[pwrs.antcnt].readPower = gPRdrStaSet->rf.tx_powers[i].read_power;
            else
                pwrs.Powers[pwrs.antcnt].readPower = tmpushort;

            if (gPRdrStaSet->rf.tx_powers[i].write_power != -1)
                //	pwrs.Powers[pwrs.antcnt].writePower = gPRdrStaSet->rf.tx_powers[i].write_power<1000? 1000:gPRdrStaSet->rf.tx_powers[i].write_power;
                pwrs.Powers[pwrs.antcnt].writePower = gPRdrStaSet->rf.tx_powers[i].write_power;
            else
                pwrs.Powers[pwrs.antcnt].writePower = tmpushort;

            pwrs.Powers[pwrs.antcnt].antid = i + 1;
            pwrs.antcnt++;
        }
    }

    TRACE("dump AntPowerConf:");

    for (i = 0; i < pwrs.antcnt; ++i)
        TRACE("%d %d %d, ", pwrs.Powers[i].antid, pwrs.Powers[i].readPower, pwrs.Powers[i].writePower);

    TRACE("\n");

    if (pwrs.antcnt > 0)
    {
        RDR_PARA_OP(ParamSet(ghReader, MTR_PARAM_RF_ANTPOWER, &pwrs));
    }

    if (gPRdrStaSet->tag_data.unique_by_antenna != -1)
    {
        tmpint = gPRdrStaSet->tag_data.unique_by_antenna;
        RDR_PARA_OP(ParamSet(ghReader, MTR_PARAM_TAGDATA_UNIQUEBYANT, &tmpint));
    }

    if (gPRdrStaSet->tag_data.unique_by_bank_data != -1)
    {
        tmpint = gPRdrStaSet->tag_data.unique_by_bank_data;
        RDR_PARA_OP(ParamSet(ghReader, MTR_PARAM_TAGDATA_UNIQUEBYEMDDATA, &tmpint));
    }

    if (gPRdrStaSet->tag_data.record_highest_rssi != -1)
    {
        tmpint = gPRdrStaSet->tag_data.record_highest_rssi;
        RDR_PARA_OP(ParamSet(ghReader, MTR_PARAM_TAGDATA_RECORDHIGHESTRSSI, &tmpint));
    }

    if (gPRdrStaSet->tagops_param.inventory.inv_mode != -1)
    {
        if (gPRdrStaSet->tagops_param.inventory.cycle == 0)
        {
            char exfmodegpara[75];
            CustomParam_ST cpmst;

            memset(exfmodegpara, 0, 75);
            strcpy(exfmodegpara, "Reader/Ex10fastmode");
            cpmst.pCusParam = exfmodegpara;
            exfmodegpara[51] = 20;
            exfmodegpara[52] = 0;
            cpmst.CParamlen = 22;

            if (gPRdrStaSet->tagops_param.inventory.inv_mode == 0)
                exfmodegpara[50] = 0;
            else
                exfmodegpara[50] = 1;

            TRACE("set Reader/Ex10fastmode:%d\n", exfmodegpara[50]);
            ParamSet(ghReader, MTR_PARAM_CUSTOM, &cpmst);
        }
    }

    if (gPRdrStaSet->tagops_param.bankdata.is_bankdata == 1)
    {
        EmbededData_ST emd;
        emd.bank = gPRdrStaSet->tagops_param.bankdata.bank;
        emd.startaddr = gPRdrStaSet->tagops_param.bankdata.start;
        emd.bytecnt = gPRdrStaSet->tagops_param.bankdata.blkcnt * 2;

        if (GetNumU32(gPRdrStaSet->tagops_param.accessop.aespwd))
            emd.accesspwd = NULL;
        else
            emd.accesspwd = gPRdrStaSet->tagops_param.accessop.aespwd;

        ParamSet(ghReader, MTR_PARAM_TAG_EMBEDEDDATA, &emd);
    }

    if (gPRdrStaSet->tagops_param.tagfilter.is_tagfilter == 1)
    {
        TagFilter_ST filter;
        filter.bank = gPRdrStaSet->tagops_param.tagfilter.bank;
        filter.startaddr = gPRdrStaSet->tagops_param.tagfilter.start;
        filter.isInvert = 1 - gPRdrStaSet->tagops_param.tagfilter.match;
        filter.fdata = gPRdrStaSet->tagops_param.tagfilter.mask;
        filter.flen = gPRdrStaSet->tagops_param.tagfilter.mask_len;
        ParamSet(ghReader, MTR_PARAM_TAG_FILTER, &filter);
    }

    {
        int transtime = 500;
        ParamSet(ghReader, MTR_PARAM_TRANS_TIMEOUT, &transtime);
    }

    if (rdr_workmode() == WorkMode_Passive)
        return rerr;

    if (gAntNumber != 1)
    {
        gConnants.antcnt = gPRdrStaSet->tagops_param.inventory.ants_cnt;

        for (i = 0; i < gConnants.antcnt; ++i)
            gConnants.connectedants[i] = gPRdrStaSet->tagops_param.inventory.ants[i];

        if (gConnants.antcnt != 0)
            hb_data()->antcount = 0;
        else
        {
            AntPortsVSWR vswr;

            for (i = 0; i < gAntNumber; ++i)
            {
                vswr.frecount = 3;
                vswr.power = 2300;
                vswr.region = RG_NA;
                vswr.frequencys[0] = 915250;
                vswr.frequencys[1] = 903250;
                vswr.frequencys[2] = 926750;
                vswr.andid = i + 1;

                rerr = ParamGet(ghReader, MTR_PARAM_RF_ANTPORTS_VSWR, &vswr);

