deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_app/projects/app/src/reader_init.c
                if (rerr != MT_OK_ERR)
                {
                    set_rdr_errstring("init reader failed");
                    CloseReader(ghReader);
                    TRACE("error when ParamGet MTR_PARAM_RF_ANTPORTS_VSWR:%d, i:%d\n", rerr, i);
                    return rerr;
                }
                else
                {
                    if ((vswr.vswrs[0] > 25) && (vswr.vswrs[1] > 25) && (vswr.vswrs[2] > 25))
                    {
                        TRACE("find ant %d\n", i + 1);
                        gConnants.connectedants[gConnants.antcnt] = i + 1;
                        gConnants.antcnt++;

                    }
                }
            }

            if (gConnants.antcnt == 0)
            {
                CloseReader(ghReader);
                strcpy(gRdrErrStrBuf, "init reader failed: no antennas found");
                TRACE("MT_HARDWARE_ALERT_ERR_BY_NO_ANTENNAS\n");
                return MT_HARDWARE_ALERT_ERR_BY_NO_ANTENNAS;
            }
            else
                hb_data()->antcount = gConnants.antcnt;

            for (i = 0; i < hb_data()->antcount; ++i)
                hb_data()->connected_antennas[i] = gConnants.connectedants[i];
        }
    }
    else
    {
        hb_data()->antcount = 0;
        gConnants.antcnt = 1;
        gConnants.connectedants[0] = 1;
    }

    TRACE("gConnants.antcnt:%d", gConnants.antcnt);

    for (i = 0; i < gConnants.antcnt; ++i)
        TRACE(" %d", gConnants.connectedants[i]);

    TRACE("\n");

    return rerr;
}


int HandleModErr()
{
    int i;

    TRACE("enter HandleModErr\n");

    if (echr_istrigger() == 1)
    {
        TRACE("if (echr_istrigger() == 1)\n");
        gErrSend = rdr_err();
        set_rdr_errstring("inv tags");
        return -1;
    }

    CloseReader(ghReader);

    for (i = 0; i < 3; ++i)
    {
        rdr_set_err(OpenReader());

        if (rdr_err() == MT_OK_ERR)
            break;
    }

    rdr_set_async_inv(0);
    gErrSend = rdr_err();

    if (rdr_err() == MT_OK_ERR)
    {
//		get_left_heap_size("HandleModErr");
        return 0;
    }
    else
    {
        TRACE("HandleModErr failed:%d\n", rdr_err());

        if (rdr_err() == MT_HARDWARE_ALERT_ERR_BY_NO_ANTENNAS)
            led_toggle(-1, 1000, NULL);
        else
            led_toggle(-1, 200, NULL);

        return -1;
    }
}

uint8 *gMqttSendBuf;
void (*g_wg_send_fn)(uint8, uint8, uint8 *);
uint8 gWgGytes;

int init_upload(void)
{
    int ret;
    commonUartPara uartPara;
    int tagbufsize;
    int isu_ant;
    int isu_bank;
    int isr_rssi;
//int baud = 115200;

//	if (uart0_bauds[uart0_bindex] > 115200)
//		baud = 460800;
//	else
//		baud = 115200;

    memset(&uartPara, 0, sizeof(commonUartPara));
    uartPara.baudrate	= gPRdrStaSet->uart1.baud;
    uartPara.databits = gPRdrStaSet->uart1.data_bits;
    uartPara.stopbits = gPRdrStaSet->uart1.stop_bits;
    uartPara.parity = gPRdrStaSet->uart1.parity;
    uartPara.flowctrl = gPRdrStaSet->uart1.flow_ctrl;
    uartPara.timeout	= 1000;
    uart_open(COMMON_INTERFACE_UART1, &uartPara);

    memset(&uartPara, 0, sizeof(commonUartPara));
    uartPara.baudrate	= gPRdrStaSet->uart2.baud;
    uartPara.databits = gPRdrStaSet->uart2.data_bits;
    uartPara.stopbits = gPRdrStaSet->uart2.stop_bits;
    uartPara.parity = gPRdrStaSet->uart2.parity;
    uartPara.flowctrl = gPRdrStaSet->uart2.flow_ctrl;
    uartPara.t485 = 1;
    uartPara.timeout	= 1000;
    uart_open(COMMON_INTERFACE_UART3, &uartPara);

    hb_data()->main_board = 1;
    firmware_version(hb_data()->software_version);
    hb_data()->hb_count = 0;

    if (gRtSetting->upload.sw_potl == Upload_Trans_Potl_Mqtt)
        CmdRecvBufLen = MqttRecvBufLen;

    TagSendBufLen = gRtSetting->glob_params.s_buf_size;

    SockSendBuffer = malloc_hexp(TagSendBufLen);
    SockRecvBuffer = malloc_hexp(CmdRecvBufLen);

//    if(gRtSetting->upload.hw_inf == Upload_Inf_Wiegand)
//    {
//        if (gRtSetting->upload.sw_potl_params.wiegand.type == Wg_Type_26)
//        {
//            g_wg_send_fn = wiegand_send26;
//            gWgGytes = 3;
//        }
//        else 	if (gRtSetting->upload.sw_potl_params.wiegand.type == Wg_Type_34)
//        {
//            g_wg_send_fn = wiegand_send34;
//            gWgGytes = 4;
//        }
//        else 	if (gRtSetting->upload.sw_potl_params.wiegand.type == Wg_Type_66)
//        {
//            g_wg_send_fn = wiegand_send66;
//            gWgGytes = 8;
//        }
//    }
    if (gRtSetting->upload.hw_inf == Upload_Inf_4G ||
             gRtSetting->upload.hw_inf == Upload_Inf_Ethernet ||
             gRtSetting->upload.hw_inf == Upload_Inf_Wifi)
    {
        char domain[100];
//		InitDegutPrintf(1, NULL, 0);

        if (gRtSetting->upload.sw_potl == Upload_Trans_Potl_Tcp)
        {
            strcpy(domain, gRtSetting->upload.sw_potl_params.tcp.ser_ip);
            net_set_ser_port(gRtSetting->upload.sw_potl_params.tcp.ser_port);
        }
        else if (gRtSetting->upload.sw_potl == Upload_Trans_Potl_Http)
        {
            init_http_fn();
            ret = url_get_domain(gRtSetting->upload.sw_potl_params.http.url,
                                 domain, net_get_ser_port_ptr(),
                                 (int *)http_abspathpos_ptr(), (int *)http_tls_ptr());

            if (ret != 0)
            {
                TRACE("!!!!!!!!!!!!!!!!!!! url_get_domain error\n");
                return -1;
            }
        }
        else if (gRtSetting->upload.sw_potl == Upload_Trans_Potl_Mqtt)
        {
            strcpy(domain, gRtSetting->upload.sw_potl_params.mqtt.host);
            net_set_ser_port(gRtSetting->upload.sw_potl_params.mqtt.port);
            http_set_tls(gRtSetting->upload.sw_potl_params.mqtt.tls);

            if (gRtSetting->upload.hw_inf == Upload_Inf_Ethernet)
                NewNetwork(mqtt_get_network(), COMMON_INTERFACE_SOCKET0, http_is_tls());
            else
                NewNetwork(mqtt_get_network(), COMMON_INTERFACE_UART1, http_is_tls());

            mqtt_get_connect_data()->willFlag = 0;
            mqtt_get_connect_data()->MQTTVersion = 4;
            mqtt_get_connect_data()->clientID.cstring = (char *)gRtSetting->glob_params.name;
            mqtt_get_connect_data()->username.cstring = gRtSetting->upload.sw_potl_params.mqtt.user;
            mqtt_get_connect_data()->password.cstring = gRtSetting->upload.sw_potl_params.mqtt.pwd;
            mqtt_get_connect_data()->keepAliveInterval = gRtSetting->upload.sw_potl_params.mqtt.kal_time;
            mqtt_get_connect_data()->cleansession = 1;
            gMqttSendBuf = malloc_hexp(TagSendBufLen + 100);
        }

        if (addr_str2bin(domain, net_get_ser_ip()) != 0 &&
                gRtSetting->upload.hw_inf == Upload_Inf_Ethernet)
        {
            int failcnt = 0;
            wiz_NetInfo info;
            int dns_sn;
            TRACE("run dns for server ip\n");
            pre_DNS_init();
            dns_sn = getMaxSocketId();
            if (dns_sn < 0)
            {
                TRACE("dns: no free socket, skip\n");
                aft_DNS_run();
                return -1;
            }
            DNS_init(dns_sn, SockSendBuffer);
            wizchip_getnetinfo(&info);
            TRACE("dnsServer:%d.%d.%d.%d\n", info.dns[0],
                  info.dns[1], info.dns[2], info.dns[3]);

            while (1)
            {
                ret =  DNS_run(info.dns, (uint8 *) domain, net_get_ser_ip());

