deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_app/projects/app/src/reader_init.c
                if (ret == 1)
                {
                    aft_DNS_run();
                    TRACE("get serip:%d.%d.%d.%d\n", net_get_ser_ip()[0],
                          net_get_ser_ip()[1], net_get_ser_ip()[2], net_get_ser_ip()[3]);
                    break;
                }
                else
                {
                    failcnt++;
                    TRACE("Dns parse failed %d times\n", failcnt);
                    sleep_ms(10000);
                }
            }
        }

        if (http_is_tls() == 1)
        {
            preinit_mbedtls();

            if (gRtSetting->upload.hw_inf == Upload_Inf_Ethernet)
                http_set_netfd(COMMON_INTERFACE_SOCKET0);
            else
                http_set_netfd(COMMON_INTERFACE_UART1);
        }

//        if (gRtSetting->upload.hw_inf == Upload_Inf_4G)
//        {
//            if (init_4g(baud, domain, net_get_ser_port(), 0, 0) == 0)
//            {
//                TRACE("init_4g ok\n");
////				g4_reconn_ser();
//            }
//            else
//            {
//                TRACE("init_4g failed\n");
//                return -1;
//            }
//        }
//        else if (gRtSetting->upload.hw_inf == Upload_Inf_Wifi)
//        {
//            if (init_wlan(baud, domain, net_get_ser_port(), 0, 0) == 0)
//            {
//                if (gRtSetting->glob_params.name[0] == 0)
//                {
//                    sprintf(gRtSetting->glob_params.name, "%02X%02X%02X%02X%02X%02X",
//                            hw_wlan()->mac[0], hw_wlan()->mac[1], hw_wlan()->mac[2], hw_wlan()->mac[3],
//                            hw_wlan()->mac[4], hw_wlan()->mac[5]);
//                }
//
//                TRACE("init_wlan ok\n");
//            }
//            else
//            {
//                TRACE("init_wlan failed\n");
//                return -1;
//            }
//        }
    }

   // tagbufsize = get_left_heap_size("tagbufsize") - DynMemReserveSize - ReaderCppMemSize;

		 tagbufsize=1024*30;
    if (http_is_tls() == 1)
        tagbufsize -= MbedTLSDynMemSize;

    tagbufsize += 8 - tagbufsize % 8;
    TRACE("tagbufsize:%d\n", tagbufsize);
    initTbBuffer(gPRdrStaSet->app_init.max_tb_rec_len, tagbufsize);
    msg_bus_init();   /* v1.0: 消息总线（主题队列 + 信号槽） */
    get_left_heap_size("after initTbBuffer");

    if (http_is_tls() == 1)
        init_mbedtls();

    get_left_heap_size("after init_mbedtls");

    if (gPRdrStaSet->tag_data.unique_by_antenna == -1)
        isu_ant = 0;
    else
        isu_ant = gPRdrStaSet->tag_data.unique_by_antenna;

    if (gPRdrStaSet->tag_data.unique_by_bank_data == -1)
        isu_bank = 1;
    else
        isu_bank = gPRdrStaSet->tag_data.unique_by_bank_data;

    if (gPRdrStaSet->tag_data.record_highest_rssi == -1)
        isr_rssi = 0;
    else
        isr_rssi = gPRdrStaSet->tag_data.record_highest_rssi;

    setUniByAnt(isu_ant);
    setUniByEmdData(isu_bank);
    setRecHighestRssi(isr_rssi);

    #if Custom_By_Caipan

    if (gRtSetting->upload.hw_inf == Upload_Inf_Wifi)
    {
        WlanConfig_ST wlanst;
        get_wlan_config(&wlanst);

        sprintf(net_get_msg_ipstr(), "%d.%d.%d.%d", wlanst.ipinfo.ip[0], wlanst.ipinfo.ip[1],
                wlanst.ipinfo.ip[2], wlanst.ipinfo.ip[3]);
        sprintf(net_get_msg_macstr(), "%02X:%02X:%02X:%02X:%02X:%02X", wlanst.ipinfo.mac[0], wlanst.ipinfo.mac[1],
                wlanst.ipinfo.mac[2], wlanst.ipinfo.mac[3], wlanst.ipinfo.mac[4], wlanst.ipinfo.mac[5]);
    }
    else
    {
        sprintf(net_get_msg_ipstr(), "%d.%d.%d.%d", hw_netconf()->ip[0], hw_netconf()->ip[1],
                hw_netconf()->ip[2], hw_netconf()->ip[3]);
        sprintf(net_get_msg_macstr(), "%02X:%02X:%02X:%02X:%02X:%02X", hw_netconf()->mac[0], hw_netconf()->mac[1],
                hw_netconf()->mac[2], hw_netconf()->mac[3], hw_netconf()->mac[4], hw_netconf()->mac[5]);
    }

    #endif
    return 0;
}





/* v9.81ch: reader state access interface (replaces cross-file extern) */
int  rdr_get_handle(void) { return ghReader; }
int  rdr_get_ant_number(void) { return gAntNumber; }
ConnAnts_ST *rdr_get_connants(void) { return &gConnants; }
int  rdr_can_async_inv(void) { return gCanAsyncInv; }
int  rdr_is_unknown_mod(void) { return gIsUnknownMod; }
int  rdr_get_uart0_bindex(void) { return uart0_bindex; }
int  rdr_get_uart0_bauds(int idx) { if (idx < 0 || idx >= 8) return 115200; return uart0_bauds[idx]; }
int  rdr_get_tag_send_len(void) { return TagSendBufLen; }
int  rdr_get_cmd_recv_len(void) { return CmdRecvBufLen; }
